[
  {
    "description": "LAX to CHI to to PIT Connection. The Vomit Twinz. AOJ are Alex O’Brien and Jerome Fitzgerald. In 2019 they performed at the Detroit Improv Festival & San Diego Improv Festival.",
    "id": "b7686689-cf19-41f6-a760-4cd7a04712a7",
    "slug": "alex-o-jerome",
    "title": "Alex O’Jerome"
  },
  {
    "description": "Boo Humbag: Musical: The most celebrated morality tale of all-time was transformed by local comedians and musicians into a hilarious send-up complete with original song and dance numbers.",
    "id": "32743ba5-3c38-4e9a-b306-b4bcea5fc3a8",
    "slug": "boo-humbag",
    "title": "Boo Humbag: The Musical"
  },
  {
    "description": "Bubble Boy: The Musical ran for a month at Arcade Comedy Theater in September 2019 to sold out audiences. Written by Cinco Paul.",
    "id": "72acdd5e-ba6c-4271-97fb-7d4f7de2508a",
    "slug": "bubble-boy-the-musical",
    "title": "Bubble Boy: The Musical"
  },
  {
    "description": "Jer (Jer) and Ky (Ky) invite guests into The Jelly Jar to talk-it-out. Who is Dracula? Who is a B*tch? Who has the best Memories? And what goes on in Cabot Cove when no one is looking? Jer & Ky are inviting guests to answer most of these questions every weak ass weekday. (MON-THU)",
    "id": "ff1e6907-c4e4-431a-9c01-28ff8a50758b",
    "slug": "jer-and-ky",
    "title": "Jer & Ky"
  },
  {
    "description": "Jerome &: A Comedic Variety Show. Past Guests have included: Anna C. Reilly, Alex O’Brien, Chanel Ali, Erica Sera, Missy Moreno, Nia Johnson, & Pallavi Gunalan",
    "id": "961e8626-5b91-4703-8629-25f2a0c82159",
    "slug": "jerome-and",
    "title": "Jerome &"
  },
  {
    "description": "JFLE is a sketch comedy duo that combines delightful absurdity with dark whimsy and musical skill. They are Jerome Fitzgerald & Jesse LE with two sold-out shows at SF Sketchfest 2020.",
    "id": "fcddeb55-5d7f-4418-ae05-a29ae394cacd",
    "slug": "jfle",
    "title": "JFLE (Jerome & Jesse LE)"
  },
  {
    "description": "The Muppets Take Manhattan, JFLE (Jerome & Jesse LE) Take Broadway. Spanning from Classic to Current to Future Broadway, JFLE and friends take you on a joyous laugh-filled non-stop ride the only way they know how: with everyone on board.",
    "id": "ea0e49e5-9665-4247-ab8e-3e0b5f27310c",
    "slug": "jfle-take-broadway",
    "title": "JFLE Take Broadway"
  },
  {
    "description": "Jerome Fitzgerald & Justin Vetter bring their acclaimed improv and heralded sketch to life on-and-off stage.",
    "id": "52582a9b-1f29-4c82-8747-cbfa61bfa912",
    "slug": "justin-and-jerome-experience",
    "title": "Justin & Jerome Experience"
  },
  {
    "description": "My Dinner With André: The Musical: “If there were a Tony for off-Broadway, short-form sketch musicals, this would win it... among the funniest things I’ve ever seen” - Pittsburgh Magazine’s Sean Collier ",
    "id": "ae04c70f-7ffa-4356-92df-685f24a953ee",
    "slug": "my-dinner-with-andre-the-musical",
    "title": "My Dinner With André: The Musical"
  },
  {
    "description": "Pittsburgh’s longest running death themed improv show. More of a celebration of life, than death itself. Let this experienced crew and their special guests take you on a journey to the other side as we put the YOU in eulogy, the FUN in funeral, and the FU in fun.",
    "id": "9b513666-9305-4cd6-91d3-ff899f762deb",
    "slug": "the-death-show",
    "title": "The Death Show"
  },
  {
    "description": "The monthly gig that gets you grooving. Live musicians and bands inspire improve comedy. For over 2 years this show has had audiences getting out of their seats dancing, and on the floor laughing.",
    "id": "2f070ad6-845d-4910-991d-e77a3043aab9",
    "slug": "the-playlist",
    "title": "The Playlist"
  },
  {
    "description": "Warp Zone was one of Arcade Comedy Theater‘s premier long-form teams for over 5 years. They had weekly and monthly shows while playing coast-to-coast. J.T.S Brown fast paced action, the Bonerz.",
    "id": "5dfa94c2-3774-4f05-9abd-166da1e3f8f9",
    "slug": "warp-zone",
    "title": "Warp Zone"
  }
]
